extends Node

@onready var typer: Typer = $Typer


func _ready() -> void:
	typer.type([
	"/empty", 2,

	["Июнь 2020-го", 14], 2, "/responce",
	"/empty", 1,

	["Я делал игры для других", 12], 2,
	["\nПравда", 12], 2, "/responce",
	"/empty", 1,

	["Я думал о том, что им понравится", 12], 1,
	["\nЧто будет интересно", 12], 1,
	["\nЧто заставит остаться", 12], 2, "/responce",
	"/empty", 1,

	["Я добавлял обучение", 12], 1,
	["\nУпрощал управление", 12], 1,
	["\nПереписывал тексты", 12], 2, "/responce",
	"/empty", 1,

	["Чтобы было понятнее", 12], 1,
	["\nЧтобы не отпугнуть", 12], 2, "/responce",
	"/empty", 2,

	["Я выкладывал игру", 12], 1,
	["\nИ ждал", 12], 2, "/responce",
	"/empty", 1,

	["Час", 14], 1,
	["\nДень", 14], 1,
	["\nНеделю", 14], 2, "/responce",
	"/empty", 1,

	["Ничего", 10], 2,
	["\nИли почти ничего", 10], 2, "/responce",
	"/empty", 1,

	["\"Неплохо\"", 12], 1,
	["\n\"Скучновато\"", 12], 1,
	["\n\"Не мое\"", 12], 2, "/responce",
	"/empty", 1,

	["Без злости", 12], 1,
	["\nБез ненависти", 12], 2,
	["\nПросто мимо", 12], 2, "/responce",
	"/empty", 2,

	["Странно", 10], 2, "/responce",
	"/empty", 1,

	["Я не злился", 12], 1,
	["\nЯ не обижался", 12], 2,
	["\nМне было пусто", 12], 2, "/responce",
	"/empty", 2,

	["Я решил,", 12], 1,
	[" что просто нужно лучше", 12], 2, "/responce",
	"/empty", 1,

	["Еще один патч", 12], 1,
	["\nЕще одна версия", 12], 1,
	["\nЕще одна игра", 12], 2, "/responce",
	"/empty", 2,

	["Ты правда старался", 10], 2, "/responce",
	"/empty", 1,

	["Это не оправдание", 12], 1,
	["\nЭто факт", 12], 2, "/responce",
	"/empty", 2,

	["Но людей все равно", 12], 1,
	["\nне становилось больше", 12], 2, "/responce",
	"/empty", 2,

	["И в какой-то момент", 12], 1,
	["\nты заметил", 12], 2, "/responce",
	"/empty", 1,

	["Что продолжаешь", 12], 1,
	["\nдаже когда", 12], 1,
	["\nникто не ждет", 12], 2, "/responce",
	"/empty", 2,

	["— А если им это не нужно?", 10], 3, "/responce",
	"/empty", 2,

	["Ты долго не отвечал", 12], 2, "/responce",
	"/empty", 2,

	["— Тогда", 10], 1,
	["\nпочему я все еще делаю?", 10], 3, "/responce",
	"/empty", 2,

	["Ответ пришел не сразу", 12], 2, "/responce",
	"/empty", 2,

	["Ты делаешь", 12], 1,
	["\nпотому что не можешь не делать", 12], 3, "/responce",
	"/empty", 2,

	["Это не значит,", 12], 1,
	[" что ты отказался от других", 12], 2, "/responce",
	"/empty", 1,

	["Это значит,", 12], 1,
	[" что ты остался", 12], 1,
	["\nбез них", 12], 3, "/responce",
	"/empty", 2,

	["И, возможно,", 12], 1,
	[" впервые честно", 12], 1,
	["\nостался с собой", 12], 3, "/responce",
	"/empty"
])
